/*
C 字符串函数
<string.h> 库提供了许多函数，允许你对字符串执行各种操作。

以下表格列出了所有字符串函数：

函数	描述
memchr()	返回内存中第一次出现某个值的指针。
memcmp()	比较两个内存块，以确定哪一个表示更大的数值。
memcpy()	将数据从一个内存块复制到另一个内存块。
memmove()	考虑到内存块可能重叠的情况，将数据从一个内存块复制到另一个内存块。
memset()	将内存块中的所有字节设置为相同的值。
strcat()	将一个字符串追加到另一个字符串的末尾。
strchr()	返回字符串中第一次出现某个字符的指针。
strcmp()	比较两个字符串中字符的 ASCII 值，以确定哪一个字符串的值更高。
strcoll()	比较两个字符串中基于区域设置的字符值，以确定哪一个字符串的值更高。
strcpy()	将一个字符串的字符复制到另一个字符串的内存中。
strcspn()	返回字符串的长度，直到出现第一个指定字符为止。
strerror()	返回描述错误代码含义的字符串。
strlen()	返回字符串的长度。
strncat()	将一个字符串中的指定数量的字符追加到另一个字符串的末尾。
strncmp()	比较两个字符串中指定数量的字符的 ASCII 值，以确定哪一个字符串的值更高。
strncpy()	将一个字符串中的指定数量的字符复制到另一个字符串的内存中。
strpbrk()	返回字符串中第一个包含指定字符之一的位置的指针。
strrchr()	返回字符串中最后一次出现某个字符的指针。
strspn()	返回字符串的长度，直到第一个不是指定字符之一的字符为止。
strstr()	返回另一个字符串中第一次出现某个字符串的指针。
strtok()	使用分隔符将字符串分割成多个部分。
strxfrm()	将字符串中的字符从 ASCII 编码转换为当前区域设置的编码。
这些函数使你能够在 C 语言中执行各种字符串操作，包括比较、复制和搜索。
*/
