/*  细心的小 A 发现，每个人的存在对于其他人来说都有着不可取代的意义。一个人的意义值定义为他的朋友和朋友的朋友的个数。

小 A 的王国共有 n 位居民，以 1,2,⋯,n 编号。每位居民分别有 x 
i
​
  个朋友，现在小 A 想知道每位居民的意义值。

注意，朋友关系可能是单向的。即：有可能 a 把 b 当朋友，但 b 不一定把 a 当作朋友。同时，如果一个人的朋友的朋友中有自己，则这一部分的个数不统计。

时光荏苒，朋友的联系也会散去。而我们和一个人保持连接的方式就是记住，仅此而已。

输入格式
第一行一个整数 n 表示小 A 王国的居民数。

接下来 n 行每行 x 
i
​
 +1 个整数。第一个整数 x 
i
​
  表示 i 号居民有几个朋友，接下来 x 
i
​
  个整数分别表示他的朋友的编号。

输出格式
一行 n 个整数分别表示每位居民的意义值。*/
#include<stdio.h>
 int main() {
    int n;
    int i;
    int people[i];
    printf("请输入小A国的居民数： \n")
    scanf("%d",&n);
    for(i=0,i<n,i++); {
        scanf


    }
    

 }